Revit 2025 API
Zone.DehumidificationSetPoint Property
Get or set the DeHumidification Set Point of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double DehumidificationSetPoint { get; set; }
Public Property DehumidificationSetPoint As Double
	Get
	Set
public:
property double DehumidificationSetPoint {
	double get ();
	void set (double value);
}
member DehumidificationSetPoint : float with get, set
Property Value
Double
Remarks
This property is used to get or set the DeHumidification Set Point of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace